# Напишите функцию, которая возвращает минимальное из пяти чисел.
# Числа передаются в качестве параметров.

def my_min(a, b, c, d, e):
    return min([a, b, c, d, e])


print(my_min(5, 9, 3, 1, 2))